app/Controllers/Admin/Akademik.php

SELECT *
FROM `kelas`
---
    public function kelas()
    {
        $model = new KelasModel();
        $data['kelas'] = $model->findAll();

SELECT `set_mapel_guru`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`, `guru_tendik`.`nama_lengkap` as `nama_guru`
FROM `set_mapel_guru`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id_guru` = `set_mapel_guru`.`id_guru`
ORDER BY `set_mapel_guru`.`jam_mulai` ASC
---
    public function jadwal()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('set_mapel_guru');
        $builder->select('set_mapel_guru.*, kelas.nama_kelas, mapel.nama_mapel, guru_tendik.nama_lengkap as nama_guru');
        $builder->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas', 'left');
        $builder->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel', 'left');
        $builder->join('guru_tendik', 'guru_tendik.id_guru = set_mapel_guru.id_guru', 'left');
        $builder->orderBy('set_mapel_guru.jam_mulai', 'ASC');
        $raw_jadwal = $builder->get()->getResultArray();

SELECT `guru_tendik`.*, `users`.`role` as `role_user`, `users`.`username`
FROM `guru_tendik`
LEFT JOIN `users` ON `users`.`id_relasi` = `guru_tendik`.`id_guru` AND `users`.`role` != 'siswa'
---
    public function guru()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('guru_tendik');
        $builder->select('guru_tendik.*, users.role as role_user, users.username');
        $builder->join('users', "users.id_relasi = guru_tendik.id_guru AND users.role != 'siswa'", 'left');

        $data['guru'] = $builder->get()->getResultArray();

SELECT *
FROM `users`
WHERE `id_relasi` = '1'
AND `role` != 'siswa'
 LIMIT 1
---
    public function update_guru($id)
    {
        $model = new GuruModel();
        $userModel = new UserModel();

        $data = [
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'gelar_depan' => $this->request->getPost('gelar_depan'),
            'gelar_belakang' => $this->request->getPost('gelar_belakang'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'status_pegawai' => $this->request->getPost('status_pegawai'),
            'nip' => $this->request->getPost('nip'),
            'nikki' => $this->request->getPost('nikki'),
            'nuptk' => $this->request->getPost('nuptk'),
            'no_kk' => $this->request->getPost('no_kk'),
            'nik' => $this->request->getPost('nik'),
            'alamat_lengkap' => $this->request->getPost('alamat_lengkap'),
            'no_hp' => $this->request->getPost('no_hp'),
            'no_sk_pengangkatan' => $this->request->getPost('no_sk_pengangkatan'),
            'tgl_sk_pengangkatan' => $this->request->getPost('tgl_sk_pengangkatan'),
            'tahun_sk_pengangkatan' => $this->request->getPost('tahun_sk_pengangkatan'),
            'no_npwp' => $this->request->getPost('no_npwp')
        ];
        $model->update($id, $data);

        // Cari user yang id_relasinya sesuai, tanpa membatasi hanya role 'guru'
        $user = $userModel->where('id_relasi', $id)->where('role !=', 'siswa')->first();

UPDATE `users` SET `username` = 'walikelas', `password` = '$2y$10$B1qNIlsJNtzzd/h0.EYP1e0osYBtSLQETqHJJOj6QUrWqy45WSck.', `updated_at` = '2026-04-05 14:42:27'
WHERE `users`.`id_user` IN ('2')
---
                $foto->move('uploads/profil/', $newName);
                $userData['foto'] = $newName;
            }
            $userModel->update($user['id_user'], $userData);

SELECT *
FROM `kelas`
---
    public function pantau_rapor()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('nilai_rapor');
        $builder->select('nilai_rapor.*, siswa.nama_siswa, mapel.nama_mapel, kelas.nama_kelas, guru_tendik.nama_lengkap as nama_guru');
        $builder->join('siswa', 'siswa.id_siswa = nilai_rapor.id_siswa', 'left');
        $builder->join('mapel', 'mapel.id_mapel = nilai_rapor.id_mapel', 'left');
        $builder->join('kelas', 'kelas.id_kelas = nilai_rapor.id_kelas', 'left');
        $builder->join('guru_tendik', 'guru_tendik.id_guru = nilai_rapor.id_guru', 'left');

        $data['rapor'] = $builder->get()->getResultArray();