app/Controllers/Admin/Akademik.php

SELECT `siswa`.*, `kelas`.`nama_kelas`, `users`.`username`
FROM `siswa`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
LEFT JOIN `users` ON `users`.`id_relasi` = `siswa`.`id_siswa` AND `users`.`role` = "siswa"
SELECT *
FROM `kelas`
---
    public function siswa()
    {
        $kelasModel = new KelasModel();
        $db = \Config\Database::connect();

        $builder = $db->table('siswa');
        $builder->select('siswa.*, kelas.nama_kelas, users.username');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas', 'left');
        $builder->join('users', 'users.id_relasi = siswa.id_siswa AND users.role = "siswa"', 'left');

        $data['siswa'] = $builder->get()->getResultArray();
        $data['kelas'] = $kelasModel->findAll();

SELECT *
FROM `kelas`
SELECT *
FROM `mapel`
---
    public function jadwal()
    {
        $model = new JadwalModel();
        $kelasModel = new KelasModel();
        $mapelModel = new MapelModel();
        $guruModel = new GuruModel();
        $data['jadwal'] = $model->findAll();
        $data['kelas'] = $kelasModel->findAll();
        $data['mapel'] = $mapelModel->findAll();