app/Controllers/Admin/Aplikasi.php

SELECT *
FROM `guru_tendik`
SELECT `set_mapel_guru`.*, `guru_tendik`.`nama_lengkap` as `nama_guru`, `mapel`.`nama_mapel`, `kelas`.`nama_kelas`
FROM `set_mapel_guru`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id_guru` = `set_mapel_guru`.`id_guru`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
ORDER BY `kelas`.`nama_kelas` ASC, `set_mapel_guru`.`hari` ASC
SELECT *
FROM `mapel`
SELECT *
FROM `kelas`
---
    public function set_mapel()
    {
        $guruModel = new GuruModel();
        $mapelModel = new MapelModel();
        $kelasModel = new KelasModel();
        $db = \Config\Database::connect();

        $builder = $db->table('set_mapel_guru');
        $builder->select('set_mapel_guru.*, guru_tendik.nama_lengkap as nama_guru, mapel.nama_mapel, kelas.nama_kelas');
        $builder->join('guru_tendik', 'guru_tendik.id_guru = set_mapel_guru.id_guru', 'left');
        $builder->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel', 'left');
        $builder->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas', 'left');
        $builder->orderBy('kelas.nama_kelas', 'ASC');
        $builder->orderBy('set_mapel_guru.hari', 'ASC');

        $data['set_mapel'] = $builder->get()->getResultArray();
        $data['guru'] = $guruModel->findAll();
        $data['mapel'] = $mapelModel->findAll();
        $data['kelas'] = $kelasModel->findAll();