app/Controllers/Admin/Kepegawaian.php

SELECT *
FROM `riwayat_pendidikan_guru`
---
    public function riwayat_pendidikan()
    {
        $model = new PendidikanGuruModel();
        $guruModel = new GuruModel();
        $data['pendidikan'] = $model->findAll();