app/Controllers/Admin/Kesiswaan.php

SELECT *
FROM `eskul`
---
    public function eskul()
    {
        $model = new EskulModel();
        $data['eskul'] = $model->findAll();