app/Views/layout/backend/sidebar.php

$role = session()->get('role');

$identitasModel = new \App\Models\IdentitasSekolahModel();
$identitas = $identitasModel->first();
---
SELECT *
FROM `identitas_sekolah`
 LIMIT 1

// Logic untuk mengambil nama asli user
$namaUser = session()->get('username');
if ($role == 'guru' || $role == 'walikelas') {
    $guruDb = \Config\Database::connect()->table('guru_tendik')->where('id_guru', session()->get('id_relasi'))->get()->getRow();
---
SELECT *
FROM `guru_tendik`
WHERE `id_guru` = '1'