app/Controllers/Walikelas/Akademik.php

    public function pantau_nilai()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');
        $wali = $db->table('set_kelas_wali')->where('id_guru', $id_guru)->get()->getRow();
        $id_kelas_wali = $wali ? $wali->id_kelas : null;

        if($id_kelas_wali){
            $builder = $db->table('nilai_rapor');
            $builder->select('nilai_rapor.*, siswa.nama_siswa, mapel.nama_mapel, guru_tendik.nama_lengkap as nama_guru');
            $builder->join('siswa', 'siswa.id_siswa = nilai_rapor.id_siswa');
            $builder->join('mapel', 'mapel.id_mapel = nilai_rapor.id_mapel');
            $builder->join('guru_tendik', 'guru_tendik.id_guru = nilai_rapor.id_guru', 'left');
            $builder->where('nilai_rapor.id_kelas', $id_kelas_wali);
            $data['rapor'] = $builder->get()->getResultArray();
---
SELECT `nilai_rapor`.*, `siswa`.`nama_siswa`, `mapel`.`nama_mapel`, `guru_tendik`.`nama_lengkap` as `nama_guru`
FROM `nilai_rapor`
JOIN `siswa` ON `siswa`.`id_siswa` = `nilai_rapor`.`id_siswa`
JOIN `mapel` ON `mapel`.`id_mapel` = `nilai_rapor`.`id_mapel`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id_guru` = `nilai_rapor`.`id_guru`
WHERE `nilai_rapor`.`id_kelas` = '1'

    public function input_nilai()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $builder = $db->table('set_mapel_guru');
        $builder->select('set_mapel_guru.id_kelas, kelas.nama_kelas, set_mapel_guru.id_mapel, mapel.nama_mapel');
        $builder->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas', 'left');
        $builder->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel', 'left');
        $builder->where('set_mapel_guru.id_guru', $id_guru);
        $builder->distinct();
        $data['tugas_mengajar'] = $builder->get()->getResultArray();

        $data['siswa'] = [];
        if(!empty($data['tugas_mengajar'])) {
            $id_kelas_array = array_column($data['tugas_mengajar'], 'id_kelas');
            $data['siswa'] = $db->table('siswa')->whereIn('id_kelas', $id_kelas_array)->get()->getResultArray();
        }

        $nilaiBuilder = $db->table('nilai_rapor');
        $nilaiBuilder->select('nilai_rapor.*, siswa.nama_siswa, mapel.nama_mapel, kelas.nama_kelas');
        $nilaiBuilder->join('siswa', 'siswa.id_siswa = nilai_rapor.id_siswa', 'left');
        $nilaiBuilder->join('mapel', 'mapel.id_mapel = nilai_rapor.id_mapel', 'left');
        $nilaiBuilder->join('kelas', 'kelas.id_kelas = nilai_rapor.id_kelas', 'left');
        $nilaiBuilder->where('nilai_rapor.id_guru', $id_guru);
        $data['nilai_rapor'] = $nilaiBuilder->get()->getResultArray();
---
SELECT `kelas`.`id_kelas`, `kelas`.`nama_kelas`, `mapel`.`id_mapel`, `mapel`.`nama_mapel`
FROM `set_mapel_guru`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
WHERE `set_mapel_guru`.`id_guru` = '1'
GROUP BY `set_mapel_guru`.`id_kelas`, `set_mapel_guru`.`id_mapel`
SELECT `nilai_rapor`.*, `siswa`.`nama_siswa`, `mapel`.`nama_mapel`, `kelas`.`nama_kelas`
FROM `nilai_rapor`
LEFT JOIN `siswa` ON `siswa`.`id_siswa` = `nilai_rapor`.`id_siswa`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `nilai_rapor`.`id_mapel`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `nilai_rapor`.`id_kelas`
WHERE `nilai_rapor`.`id_guru` = '1'