app/Controllers/Walikelas/Akademik.php

SELECT `kelas`.*
FROM `set_kelas_wali`
JOIN `kelas` ON `kelas`.`id_kelas` = `set_kelas_wali`.`id_kelas`
WHERE `set_kelas_wali`.`id_guru` = '1'
---
    public function data_kelas()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $builder = $db->table('set_kelas_wali');
        $builder->select('kelas.*');
        $builder->join('kelas', 'kelas.id_kelas = set_kelas_wali.id_kelas');
        $builder->where('set_kelas_wali.id_guru', $id_guru);
        $data['kelas'] = $builder->get()->getResultArray();

SELECT *
FROM `set_kelas_wali`
WHERE `id_guru` = '1'
SELECT `siswa`.*, `kelas`.`nama_kelas`
FROM `siswa`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
WHERE `siswa`.`id_kelas` = '1'
---
    public function data_siswa($id_kelas = null)
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $wali = $db->table('set_kelas_wali')->where('id_guru', $id_guru)->get()->getRow();
        $id_kelas_wali = $wali ? $wali->id_kelas : null;

        if($id_kelas_wali){
            $builder = $db->table('siswa');
            $builder->select('siswa.*, kelas.nama_kelas');
            $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas', 'left');
            $builder->where('siswa.id_kelas', $id_kelas_wali);
            $data['siswa'] = $builder->get()->getResultArray();

SELECT *
FROM `set_kelas_wali`
WHERE `id_guru` = '1'
SELECT `set_mapel_guru`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`, `guru_tendik`.`nama_lengkap` as `nama_guru`
FROM `set_mapel_guru`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id_guru` = `set_mapel_guru`.`id_guru`
WHERE `set_mapel_guru`.`id_kelas` = '1'
ORDER BY `set_mapel_guru`.`jam_mulai` ASC
---
    public function jadwal()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $wali = $db->table('set_kelas_wali')->where('id_guru', $id_guru)->get()->getRow();
        $id_kelas_wali = $wali ? $wali->id_kelas : null;

        $jadwal_grouped = [
            'Senin' => [],
            'Selasa' => [],
            'Rabu' => [],
            'Kamis' => [],
            'Jumat' => [],
            'Sabtu' => [],
            'Minggu' => []
        ];

        if ($id_kelas_wali) {
            $builder = $db->table('set_mapel_guru');
            $builder->select('set_mapel_guru.*, kelas.nama_kelas, mapel.nama_mapel, guru_tendik.nama_lengkap as nama_guru');
            $builder->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas', 'left');
            $builder->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel', 'left');
            $builder->join('guru_tendik', 'guru_tendik.id_guru = set_mapel_guru.id_guru', 'left');
            $builder->where('set_mapel_guru.id_kelas', $id_kelas_wali);
            $builder->orderBy('set_mapel_guru.jam_mulai', 'ASC');
            $raw_jadwal = $builder->get()->getResultArray();

SELECT *
FROM `kelas`
WHERE `id_kelas` = '1'
---
        $data['jadwal_grouped'] = $jadwal_grouped;

        if ($id_kelas_wali) {
            $kelas = $db->table('kelas')->where('id_kelas', $id_kelas_wali)->get()->getRow();

SELECT *
FROM `set_kelas_wali`
WHERE `id_guru` = '1'
SELECT *
FROM `siswa`
WHERE `id_kelas` = '1'
ORDER BY `nama_siswa` ASC
SELECT DISTINCT `set_mapel_guru`.`id_mapel`, `mapel`.`nama_mapel`, `guru_tendik`.`nama_lengkap` as `nama_guru`
FROM `set_mapel_guru`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id_guru` = `set_mapel_guru`.`id_guru`
WHERE `set_mapel_guru`.`id_kelas` = '1'
SELECT *
FROM `nilai_rapor`
WHERE `id_kelas` = '1'
---
    public function pantau_nilai()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');
        $wali = $db->table('set_kelas_wali')->where('id_guru', $id_guru)->get()->getRow();
        $id_kelas_wali = $wali ? $wali->id_kelas : null;

        $rapor_lengkap = [];

        if($id_kelas_wali){
            $siswa = $db->table('siswa')->where('id_kelas', $id_kelas_wali)->orderBy('nama_siswa', 'ASC')->get()->getResultArray();

            $builder = $db->table('set_mapel_guru');
            $builder->select('set_mapel_guru.id_mapel, mapel.nama_mapel, guru_tendik.nama_lengkap as nama_guru');
            $builder->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel', 'left');
            $builder->join('guru_tendik', 'guru_tendik.id_guru = set_mapel_guru.id_guru', 'left');
            $builder->where('set_mapel_guru.id_kelas', $id_kelas_wali);
            $builder->distinct();
            $mapel_kelas = $builder->get()->getResultArray();

            $nilai_rapor = $db->table('nilai_rapor')->where('id_kelas', $id_kelas_wali)->get()->getResultArray();

SELECT *
FROM `set_kelas_wali`
WHERE `id_guru` = '1'
SELECT `siswa`.*, `kelas`.`nama_kelas`
FROM `siswa`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
WHERE `siswa`.`id_kelas` = '1'
---
    public function cetak_rapor()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');
        $wali = $db->table('set_kelas_wali')->where('id_guru', $id_guru)->get()->getRow();
        $id_kelas_wali = $wali ? $wali->id_kelas : null;

        if($id_kelas_wali){
            $builder = $db->table('siswa');
            $builder->select('siswa.*, kelas.nama_kelas');
            $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas', 'left');
            $builder->where('siswa.id_kelas', $id_kelas_wali);
            $data['siswa'] = $builder->get()->getResultArray();

SELECT *
FROM `set_mapel_guru`
WHERE `id_guru` = '1'
SELECT *
FROM `kelas`
WHERE `id_kelas` IN ('1')
SELECT `siswa`.*, `kelas`.`nama_kelas`
FROM `siswa`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
WHERE `siswa`.`id_kelas` IN ('1')
SELECT *
FROM `mapel`
WHERE `id_mapel` IN ('1')
---
    public function input_nilai()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $tugas = $db->table('set_mapel_guru')->where('id_guru', $id_guru)->get()->getResultArray();
        $id_kelas_list = array_values(array_unique(array_column($tugas, 'id_kelas')));
        $id_mapel_list = array_values(array_unique(array_column($tugas, 'id_mapel')));

        if (!empty($id_kelas_list)) {
            $data['kelas'] = $db->table('kelas')->whereIn('id_kelas', $id_kelas_list)->get()->getResultArray();
            $data['siswa'] = $db->table('siswa')
                                ->select('siswa.*, kelas.nama_kelas')
                                ->join('kelas', 'kelas.id_kelas = siswa.id_kelas', 'left')
                                ->whereIn('siswa.id_kelas', $id_kelas_list)
                                ->get()->getResultArray();
        } else {
            $data['kelas'] = [];
            $data['siswa'] = [];
        }

        if (!empty($id_mapel_list)) {
            $data['mapel'] = $db->table('mapel')->whereIn('id_mapel', $id_mapel_list)->get()->getResultArray();