app/Controllers/Walikelas/Dashboard.php

SELECT *
FROM `set_kelas_wali`
WHERE `id_guru` = '1'
SELECT COUNT(*) AS `numrows`
FROM `siswa`
WHERE `id_kelas` = '1'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT *
FROM `set_mapel_guru`
WHERE `id_guru` = '1'
GROUP BY `id_mapel`
) CI_count_all_results
SELECT *
FROM `beban_kerja_guru`
WHERE `id_guru` = '1'
SELECT COUNT(*) AS `numrows`
FROM `pengumuman`
WHERE `id_user` = '2'
SELECT *
FROM `guru_tendik`
WHERE `id_guru` = '1'
---
    public function index()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');
        $id_user = session()->get('id_user');

        $wali = $db->table('set_kelas_wali')->where('id_guru', $id_guru)->get()->getRow();
        $id_kelas_wali = $wali ? $wali->id_kelas : null;

        $data['total_siswa'] = $id_kelas_wali ? $db->table('siswa')->where('id_kelas', $id_kelas_wali)->countAllResults() : 0;
        $data['total_mapel'] = $db->table('set_mapel_guru')->where('id_guru', $id_guru)->groupBy('id_mapel')->countAllResults();

        $beban = $db->table('beban_kerja_guru')->where('id_guru', $id_guru)->get()->getRow();
        $data['total_jam'] = $beban ? $beban->jumlah_jam_kerja : 0;

        $data['total_pengumuman'] = $db->table('pengumuman')->where('id_user', $id_user)->countAllResults();

        $guru = $db->table('guru_tendik')->where('id_guru', $id_guru)->get()->getRow();