app/Controllers/Guru/Akademik.php

SELECT `set_mapel_guru`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`
FROM `set_mapel_guru`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
LEFT JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
WHERE `set_mapel_guru`.`id_guru` = '2'
ORDER BY `set_mapel_guru`.`hari` ASC
---
    public function jadwal()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $builder = $db->table('set_mapel_guru');
        $builder->select('set_mapel_guru.*, kelas.nama_kelas, mapel.nama_mapel');
        $builder->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas', 'left');
        $builder->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel', 'left');
        $builder->where('set_mapel_guru.id_guru', $id_guru);
        $builder->orderBy('set_mapel_guru.hari', 'ASC');

        $data['jadwal'] = $builder->get()->getResultArray();

SELECT DISTINCT `kelas`.`id_kelas`, `kelas`.`nama_kelas`
FROM `set_mapel_guru`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
WHERE `set_mapel_guru`.`id_guru` = '2'
---
    public function data_kelas()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $builder = $db->table('set_mapel_guru');
        $builder->select('kelas.id_kelas, kelas.nama_kelas');
        $builder->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas', 'left');
        $builder->where('set_mapel_guru.id_guru', $id_guru);
        $builder->distinct();

        $data['kelas'] = $builder->get()->getResultArray();

SELECT *
FROM `kelas`
WHERE `id_kelas` = '1'
SELECT `siswa`.*, `kelas`.`nama_kelas`
FROM `siswa`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
WHERE `siswa`.`id_kelas` = '1'
---
    public function data_siswa($id_kelas = null)
    {
        if (!$id_kelas) return redirect()->to(base_url('guru/akademik/data_kelas'));

        $db = \Config\Database::connect();
        $kelas = $db->table('kelas')->where('id_kelas', $id_kelas)->get()->getRowArray();

        $builder = $db->table('siswa');
        $builder->select('siswa.*, kelas.nama_kelas');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas', 'left');
        $builder->where('siswa.id_kelas', $id_kelas);

        $data['siswa'] = $builder->get()->getResultArray();

SELECT `set_mapel_guru`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`
FROM `set_mapel_guru`
JOIN `kelas` ON `kelas`.`id_kelas` = `set_mapel_guru`.`id_kelas`
JOIN `mapel` ON `mapel`.`id_mapel` = `set_mapel_guru`.`id_mapel`
WHERE `set_mapel_guru`.`id_guru` = '2'
SELECT *
FROM `siswa`
WHERE `id_kelas` IN ('1')
SELECT `nilai_rapor`.*, `siswa`.`nama_siswa`, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`
FROM `nilai_rapor`
JOIN `siswa` ON `siswa`.`id_siswa` = `nilai_rapor`.`id_siswa`
JOIN `kelas` ON `kelas`.`id_kelas` = `nilai_rapor`.`id_kelas`
JOIN `mapel` ON `mapel`.`id_mapel` = `nilai_rapor`.`id_mapel`
WHERE `nilai_rapor`.`id_guru` = '2'
---
    public function input_nilai()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');

        $tugas_mengajar = $db->table('set_mapel_guru')
            ->select('set_mapel_guru.*, kelas.nama_kelas, mapel.nama_mapel')
            ->join('kelas', 'kelas.id_kelas = set_mapel_guru.id_kelas')
            ->join('mapel', 'mapel.id_mapel = set_mapel_guru.id_mapel')
            ->where('set_mapel_guru.id_guru', $id_guru)
            ->get()->getResultArray();

        $kelas_ids = array_column($tugas_mengajar, 'id_kelas');

        if(!empty($kelas_ids)){
            $data['siswa'] = $db->table('siswa')->whereIn('id_kelas', $kelas_ids)->get()->getResultArray();
        } else {
            $data['siswa'] = [];
        }

        $data['tugas'] = $tugas_mengajar;

        $builder = $db->table('nilai_rapor');
        $builder->select('nilai_rapor.*, siswa.nama_siswa, kelas.nama_kelas, mapel.nama_mapel');
        $builder->join('siswa', 'siswa.id_siswa = nilai_rapor.id_siswa');
        $builder->join('kelas', 'kelas.id_kelas = nilai_rapor.id_kelas');
        $builder->join('mapel', 'mapel.id_mapel = nilai_rapor.id_mapel');
        $builder->where('nilai_rapor.id_guru', $id_guru);

        $data['rapor'] = $builder->get()->getResultArray();