app/Controllers/Guru/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();
        $id_guru = session()->get('id_relasi');
        $id_user = session()->get('id_user');

        $data['total_kelas'] = $db->table('set_mapel_guru')->where('id_guru', $id_guru)->groupBy('id_kelas')->countAllResults();

        $kelas_ids = $db->table('set_mapel_guru')->select('id_kelas')->where('id_guru', $id_guru)->groupBy('id_kelas')->get()->getResultArray();
        $ids = array_column($kelas_ids, 'id_kelas');
        $data['total_siswa'] = empty($ids) ? 0 : $db->table('siswa')->whereIn('id_kelas', $ids)->countAllResults();

        $beban = $db->table('beban_kerja_guru')->where('id_guru', $id_guru)->get()->getRow();
        $data['total_jam'] = $beban ? $beban->jumlah_jam_kerja : 0;

        $data['total_berita'] = $db->table('berita')->where('id_user', $id_user)->countAllResults();

        $guru = $db->table('guru_tendik')->where('id_guru', $id_guru)->get()->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT *
FROM `set_mapel_guru`
WHERE `id_guru` = '2'
GROUP BY `id_kelas`
) CI_count_all_results
SELECT `id_kelas`
FROM `set_mapel_guru`
WHERE `id_guru` = '2'
GROUP BY `id_kelas`
SELECT COUNT(*) AS `numrows`
FROM `siswa`
WHERE `id_kelas` IN ('1')
SELECT *
FROM `beban_kerja_guru`
WHERE `id_guru` = '2'
SELECT COUNT(*) AS `numrows`
FROM `berita`
WHERE `id_user` = '3'
SELECT *
FROM `guru_tendik`
WHERE `id_guru` = '2'