app/Controllers/Auth.php

    public function proses()
    {
        $usersModel = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $usersModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'walikelas'
 LIMIT 1